schemas/src/main/resources/schemas/certificate/v1/interactions/SetConsentInteraction/SetConsentInteraction_1.0_rivtabp20.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<!-- 
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership. Sveriges Kommuner och Landsting licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
 -->        
<wsdl:definitions name='SetConsentInteraction' 
  xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/' 
  xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/' 
  xmlns:xs='http://www.w3.org/2001/XMLSchema' 
  xmlns:tjsr='urn:riv:insuranceprocess:healthreporting:SetConsentResponder:1' 
  xmlns:tjsi='urn:riv:insuranceprocess:healthreporting:SetConsentInitiator:1' 
  xmlns:tns='urn:riv:insuranceprocess:healthreporting:SetConsent:1:rivtabp20' 
  targetNamespace='urn:riv:insuranceprocess:healthreporting:SetConsent:1:rivtabp20' 
  xmlns:wsa="http://www.w3.org/2005/08/addressing" 
  >
  
  <xs:annotation>
    <xs:documentation>
             Tjänsteinteraktionens namn: SetConsentInteraction
             Beskrivning: 
               Sätter medgivande status om intyg får hanteras elektroniskt. statusen kan vara positiv (medgivande ges) eller negativ (medgivande ges ej).
             Revisioner: 
                2012-08-09: Initial version (Marcus Krantz and Roger Lindsjö, Callista Enterprise AB)
             Tjänstedomän: insuranceprocess:healthreporting
             Tjänsteinteraktionstyp: Fråga-Svar
             WS-profil: RIVTABP20
             Förvaltas av: Sveriges Kommuner och Landsting
             </xs:documentation>
  </xs:annotation>
  
  <wsdl:types>
    <xs:schema targetNamespace='urn:riv:insuranceprocess:healthreporting:SetConsent:1:rivtabp21'>
      <xs:import schemaLocation='SetConsentResponder_1.0.xsd' namespace='urn:riv:insuranceprocess:healthreporting:SetConsentResponder:1' />
      <xs:import schemaLocation='../../core_components/ws-addressing-1.0.xsd' namespace='http://www.w3.org/2005/08/addressing'/>
    </xs:schema>
  </wsdl:types>
  
  <wsdl:message name='SetConsentRequest'>
    <wsdl:part name='LogicalAddress' element='wsa:To'>
      <wsdl:documentation>The organisation number of the receiving insurance institution</wsdl:documentation>
    </wsdl:part>
    <wsdl:part name='parameters' element='tjsr:SetConsentRequest' />
  </wsdl:message>
  
  <wsdl:message name='SetConsentResponse'>
    <wsdl:part name='parameters' element='tjsr:SetConsentResponse' />
  </wsdl:message>
  
  <wsdl:portType name='SetConsentResponderInterface'>
    <wsdl:operation name='SetConsent'>
      <wsdl:input message='tns:SetConsentRequest' />
      <wsdl:output message='tns:SetConsentResponse' />
    </wsdl:operation>
  </wsdl:portType>
  
  <wsdl:binding name='SetConsentResponderBinding' type='tns:SetConsentResponderInterface'>
    <soap:binding style='document' transport='http://schemas.xmlsoap.org/soap/http' />
    <wsdl:operation name='SetConsent'>
      <soap:operation soapAction='urn:riv:insuranceprocess:healthreporting:SetConsentResponder:1:SetConsent' style='document' />
      <wsdl:input>
        <soap:header use='literal' message='tns:SetConsentRequest' part='LogicalAddress' />
        <soap:body use='literal' parts='parameters' />
      </wsdl:input>
      <wsdl:output>
        <soap:body use='literal' />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  
  <wsdl:service name='SetConsentResponderService'>
    <wsdl:port name='SetConsentResponderPort' binding='tns:SetConsentResponderBinding'>
      <soap:address location='http://tempuri.org' />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>