web/src/test/resources/integrationtests/setconsent/requests.stg

delimiters "$", "$"

request(data) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:riv:insuranceprocess:healthreporting:SetConsentResponder:1">
   <soapenv:Header>
      <add:To></add:To>
   </soapenv:Header>
   <soapenv:Body>
      <urn:SetConsentRequest>
         <urn:personnummer>$data.personId$</urn:personnummer>
         <urn:consent-given>$data.consent$</urn:consent-given>
      </urn:SetConsentRequest>
   </soapenv:Body>
</soapenv:Envelope>
>>
